aiqubit.claude
akamud.vscode-theme-onedark
batisteo.vscode-django
charliermarsh.ruff
christian-kohler.path-intellisense
continue.continue
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
github.copilot
github.copilot-chat
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
njpwerner.autodocstring
redhat.vscode-yaml
saoudrizwan.claude-dev
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wholroyd.jinja
